{
  "projects": [
    {
      "name": "DoDo",
      "description": "DoDo is a ToDo website where users can create an account and enter their ToDos. This project was my first practical application of React.js.",
      "img": "/images/dodo.png",
      "icons": ["/images/icons/dodo1.png", "/images/icons/dodo2.png"],
      "backgroundColor1": "#81e9ba",
      "backgroundColor2": "#44f2b8",
      "usedTechnologies": [
        {
          "name": "React",
          "icon": "/images/logos/ReactLogo.png",
          "description": "Using React for the front-end of my website allowed me to efficiently structure my code and develop with greater speed."
        },
        {
          "name": "Node.js",
          "icon": "/images/logos/NodeLogo.png",
          "description": "The combination of Node.js and Express.js enabled me to seamlessly transfer data from the front-end to the back-end."
        },
        {
          "name": "MySql",
          "icon": "/images/logos/MySqlLogo.png",
          "description": "By utilizing MySql as the database to store user data and task information, it greatly assisted me in the development of a todo platform."
        },
        {
          "name": "Heroku",
          "icon": "/images/logos/HerokuLogo.png",
          "description": "Heroku was instrumental in hosting both the node.js app and backend application for me.."
        }
      ],
      "emergence": "I have recently begun learning React, and I decided to create my own ToDo platform to aid my learning process. Although building a ToDo platform is a common project for new React programmers, I challenged myself by incorporating User Management functionality into it",
      "result": "A ToDo Website run on Heroku but currently inactive",
      "link": "https://github.com/Hannes30/to-do",
      "linkName": "Github"
    },
    {
      "name": "BudgetBooster",
      "description": "BudgetBooster is a game I developed using Next.js, is hosted on our own server. It teaches teenagers about wise financial decisions through a fun and engaging gameplay.",
      "img": "/images/bb.jpg",
      "icons": ["/images/icons/bb1.png", "/images/icons/bb2.png"],
      "backgroundColor1": "#e9d981",
      "backgroundColor2": "#f2d844",
      "usedTechnologies": [
        {
          "name": "Next.js",
          "icon": "/images/logos/nextjsLogo.png",
          "description": "Next.js proved to be the perfect solution for enabling efficient communication between the front-end and back-end during the development of my app, allowing me to work with greater speed and productivity."
        },
        {
          "name": "Chart.js",
          "icon": "/images/logos/chartjsLogo.png",
          "description": "Chart Js helped me to visualize the Data i got from my Players .It was easy to learn and use."
        },
        {
          "name": "MySql",
          "icon": "/images/logos/MySqlLogo.png",
          "description": "For storing the stats of my players, I relied on MySql as my preferred database solution, which proved to be a reliable and efficient choice."
        }
      ],
      "emergence": "A teacher at my school introduced me to the Kardea Price project, which focuses on teenagers and money management. This sparked an idea for a game where the user can practice managing their spending habits.",
      "result": "A Website where Player can play the Game and Learn about Money",
      "link": "https://budget-booster.vitreus.at/",
      "linkName": "BudgetBooster"
    },
    {
      "name": "Furt",
      "description": "Furt is a Mobile Game about Colors. The Player has to Shoot the color in the right area and avoid obstacles. The Game is made with Unity and runs on Android",
      "img": "/images/furt.png",
      "icons": ["/images/icons/furt1.png", "/images/icons/furt2.png"],
      "backgroundColor1": "#f244d8",
      "backgroundColor2": "#ecba4e",
      "usedTechnologies": [
        {
          "name": "Unity",
          "icon": "/images/logos/UnityLogo.png",
          "description": "Unity is my preferred game engine for programming games, thanks to its built-in mobile support that made it a perfect fit for creating my mobile game."
        },
        {
          "name": "Photoshop",
          "icon": "/images/logos/PSLogo.png",
          "description": "With Photoshop, I was able to create all of the necessary assets for my games."
        }
      ],
      "emergence": "I had some free time and decided to create a mobile game. While I had prior knowledge of Unity, I had never developed a mobile game before. Since I wanted to create a game based on colors, I began programming.",
      "result": "A Mobiel Game Called FURT for Android",
      "link": "https://mega.nz/file/BQIQDaCA#2BB5DcKipsTNz0WgulyojwGsuiVGMQVDQ81VsAE02hA",
      "linkName": "Download"
    },
    {
      "name": "In progress",
      "description": "I always work on new projects. So be on the lookout for my next project",
      "img": "/images/new.png",
      "icons": ["/images/icons/new1.png", "/images/icons/new2.png"],
      "backgroundColor1": "#fff",
      "backgroundColor2": "#eee",
      "usedTechnologies": [
        {
          "name": "Flutter",
          "icon": "/images/logos/FlutterLogo.png",
          "description": "My nxt Project will use Flutter for the frontend"
        },
        {
          "name": "Node.js",
          "icon": "/images/logos/NodeLogo.png",
          "description": "Node.js will function as my backend"
        },
        {
          "name": "MySql",
          "icon": "/images/logos/MySqlLogo.png",
          "description": "MySql will store the data about my users"
        },
        {
          "name": "JWT",
          "icon": "/images/logos/jwtLogo.png",
          "description": "For this Project i will use JWT to authenticate my data"
        }
      ],
      "emergence": "My Next Project is still hidden from you.But you look on my github for Projects ;)",
      "result": "___",
      "link": "https://github.com/Hannes30",
      "linkName": "Github"
    }
  ]
}
