{
  "projects": [
    {
      "name": "DoDo",
      "description": "DoDo ist eine ToDo-Website, auf der Benutzer ein Konto erstellen und ihre Aufgaben eingeben können. Dieses Projekt war meine erste praktische Anwendung von React.js.",
      "img": "/images/dodo.png",
      "icons": ["/images/icons/dodo1.png", "/images/icons/dodo2.png"],
      "backgroundColor1": "#81e9ba",
      "backgroundColor2": "#44f2b8",
      "usedTechnologies": [
        {
          "name": "React",
          "icon": "/images/logos/ReactLogo.png",
          "description": "Die Verwendung von React für das Front-End meiner Website ermöglichte es mir, meinen Code effizient zu strukturieren und mit größerer Geschwindigkeit zu entwickeln."
        },
        {
          "name": "Node.js",
          "icon": "/images/logos/NodeLogo.png",
          "description": "Die Kombination aus Node.js und Express.js ermöglichte es mir, Daten nahtlos vom Front-End zum Back-End zu übertragen."
        },
        {
          "name": "MySql",
          "icon": "/images/logos/MySqlLogo.png",
          "description": "Durch die Verwendung von MySql als Datenbank zur Speicherung von Benutzerdaten und Aufgabeninformationen wurde mir die Entwicklung einer ToDo-Plattform erheblich erleichtert."
        },
        {
          "name": "Heroku",
          "icon": "/images/logos/HerokuLogo.png",
          "description": "Heroku spielte eine entscheidende Rolle bei der Bereitstellung sowohl der Node.js-App als auch der Backend-Anwendung."
        }
      ],
      "emergence": "Ich habe erst kürzlich mit dem Lernen von React begonnen und mich entschieden, meine eigene ToDo-Plattform zu erstellen, um meinen Lernprozess zu unterstützen. Obwohl das Erstellen einer ToDo-Plattform ein übliches Projekt für neue React-Programmierer ist, habe ich mich herausgefordert, indem ich die Funktionalität zur Benutzerverwaltung integriert habe.",
      "result": "Eine ToDo-Website, die auf Heroku gehostet wird, derzeit jedoch inaktiv ist.",
      "link": "https://github.com/Hannes30/to-do",
      "linkName": "Github"
    },
    {
      "name": "BudgetBooster",
      "description": "BudgetBooster ist ein Spiel, das ich mit Next.js entwickelt habe und auf unserem eigenen Server gehostet wird. Es vermittelt Teenagern auf spielerische und unterhaltsame Weise kluge finanzielle Entscheidungen.",
      "img": "/images/bb.jpg",
      "icons": ["/images/icons/bb1.png", "/images/icons/bb2.png"],
      "backgroundColor1": "#e9d981",
      "backgroundColor2": "#f2d844",
      "usedTechnologies": [
        {
          "name": "Next.js",
          "icon": "/images/logos/nextjsLogo.png",
          "description": "Next.js erwies sich als die perfekte Lösung, um die effiziente Kommunikation zwischen Front-End und Back-End während der Entwicklung meiner App zu ermöglichen, was mir eine schnellere und produktivere Arbeit ermöglichte."
        },
        {
          "name": "Chart.js",
          "icon": "/images/logos/chartjsLogo.png",
          "description": "Chart Js half mir, die Daten, die ich von meinen Spielern erhalten habe, zu visualisieren. Es war einfach zu erlernen und zu verwenden."
        },
        {
          "name": "MySql",
          "icon": "/images/logos/MySqlLogo.png",
          "description": "Für die Speicherung der Statistiken meiner Spieler verließ ich mich auf MySql als meine bevorzugte Datenbanklösung, die sich als zuverlässige und effiziente Wahl erwies."
        }
      ],
      "emergence": "Ein Lehrer an meiner Schule stellte mir das Kardea Price-Projekt vor, das sich auf Jugendliche und Geldmanagement konzentriert. Dies brachte mich auf die Idee eines Spiels, bei dem der Benutzer das Verwalten seiner Ausgabegewohnheiten üben kann.",
      "result": "Eine Website, auf der Spieler das Spiel spielen und etwas über Geld lernen können.",
      "link": "https://budget-booster.vitreus.at/",
      "linkName": "BudgetBooster"
    },
    {
      "name": "Furt",
      "description": "Furt ist ein Mobilspiel über Farben. Der Spieler muss die Farbe im richtigen Bereich abschießen und Hindernissen ausweichen. Das Spiel wurde mit Unity erstellt und läuft auf Android.",
      "img": "/images/furt.png",
      "icons": ["/images/icons/furt1.png", "/images/icons/furt2.png"],
      "backgroundColor1": "#f244d8",
      "backgroundColor2": "#ecba4e",
      "usedTechnologies": [
        {
          "name": "Unity",
          "icon": "/images/logos/UnityLogo.png",
          "description": "Unity ist meine bevorzugte Spielengine für die Programmierung von Spielen, dank ihrer integrierten Unterstützung für Mobilgeräte, die perfekt für die Erstellung meines Mobilspiels geeignet ist."
        },
        {
          "name": "Photoshop",
          "icon": "/images/logos/PSLogo.png",
          "description": "Mit Photoshop konnte ich alle erforderlichen Assets für meine Spiele erstellen."
        }
      ],
      "emergence": "Ich hatte etwas Freizeit und beschloss, ein Mobilspiel zu erstellen. Obwohl ich bereits Vorwissen in Unity hatte, hatte ich zuvor noch nie ein Mobilspiel entwickelt. Da ich ein Spiel basierend auf Farben erstellen wollte, begann ich mit der Programmierung.",
      "result": "Ein Mobilspiel namens FURT für Android.",
      "link": "https://mega.nz/file/BQIQDaCA#2BB5DcKipsTNz0WgulyojwGsuiVGMQVDQ81VsAE02hA",
      "linkName": "Download"
    },
    {
      "name": "In Arbeit",
      "description": "Ich arbeite ständig an neuen Projekten. Seien Sie also gespannt auf mein nächstes Projekt.",
      "img": "/images/new.png",
      "icons": ["/images/icons/new1.png", "/images/icons/new2.png"],
      "backgroundColor1": "#fff",
      "backgroundColor2": "#eee",
      "usedTechnologies": [
        {
          "name": "Flutter",
          "icon": "/images/logos/FlutterLogo.png",
          "description": "Mein nächstes Projekt wird Flutter für das Frontend verwenden"
        },
        {
          "name": "Node.js",
          "icon": "/images/logos/NodeLogo.png",
          "description": "Node.js wird als mein Backend dienen"
        },
        {
          "name": "MySql",
          "icon": "/images/logos/MySqlLogo.png",
          "description": "MySql wird die Daten über meine Benutzer speichern"
        },
        {
          "name": "JWT",
          "icon": "/images/logos/jwtLogo.png",
          "description": "Für dieses Projekt werde ich JWT verwenden, um meine Daten zu authentifizieren"
        }
      ],
      "emergence": "Mein nächstes Projekt ist noch vor Ihnen verborgen. Aber Sie können auf meinem GitHub nach Projekten suchen ;)",
      "result": "___",
      "link": "https://github.com/Hannes30",
      "linkName": "Github"
    }
  ]
}

