{
  "projects": [
    {
      "name": "Hofcafe Wolfpassing",
      "description": "Die Website für das Hofcafe Schloss Wolfpassing von Elfriede Halbartschlagerl.Design,Bilder und Entwicklung wurde von mir übernommen",
      "img": "/images/Hofcafe.png",
      "icons": ["/images/icons/beer.png", "/images/icons/coffee.png"],
      "backgroundColor1": "#2fb1c1",
      "backgroundColor2": "#fff",
      "usedTechnologies": [
        {
          "name": "Next.js",
          "icon": "/images/logos/nextjsLogo.png",
          "description": "Next.js ist mein bevorzugtes JS Framework. Es half deutlich darin die SEO zu optimieren"
        },
        {
          "name": "Strapi.js",
          "icon": "/images/logos/NodeLogo.png",
          "description": "Strapi und Next.js sind eine perfekte Kombination es exestiert immer noch die Freiheit alles selber zu gestalten jedoch auch ein CMS für die Betreuer"
        },
        {
          "name": "Heroku",
          "icon": "/images/logos/HerokuLogo.png",
          "description": "Strapi braucht eine Online Datenbank und muss gehostet werden mit Heroku ist das beides möglich"
        },
        {
          "name": "AWS S3",
          "icon": "/images/logos/awsLogo.png",
          "description": "Die Hochgeladenen Bilder müssen in einen Amazon S3 Bucket gespeichert werden da die Speicherung in der HEroku Datenbank nicht optimal ist"
        }
      ],
      "emergence": "Bei Meinen Praktikum im Sommer traf ich die Chefin des Hofcafe und wir machten uns einen Termin für die Erstbesprechung aus",
      "result": "DIe Website für das Hofcafe Wolfpassing + CMS",
      "link": "https://schlosswolfpassing.at/",
      "linkName": "Hofacfe Schloss Wolfpassing"
    },
    {
      "name": "BudgetBooster",
      "description": "BudgetBooster ist ein Spiel, das ich mit Next.js entwickelt habe und auf unserem eigenen Server gehostet wird. Es vermittelt Teenagern auf spielerische und unterhaltsame Weise kluge finanzielle Entscheidungen.",
      "img": "/images/bb.jpg",
      "icons": ["/images/icons/bb1.png", "/images/icons/bb2.png"],
      "backgroundColor1": "#e9d981",
      "backgroundColor2": "#f2d844",
      "usedTechnologies": [
        {
          "name": "Next.js",
          "icon": "/images/logos/nextjsLogo.png",
          "description": "Next.js erwies sich als die perfekte Lösung, um die effiziente kommunikation zwischen Front-End und Back-End während der Entwicklung meiner App zu ermöglichen, was mir eine schnellere und produktivere Arbeit ermöglichte."
        },
        {
          "name": "Chart.js",
          "icon": "/images/logos/chartjsLogo.png",
          "description": "Chart Js half mir, die Daten, die ich von meinen Spielern erhalten habe, zu visualisieren. Es war einfach zu erlernen und zu verwenden."
        },
        {
          "name": "MYSQL",
          "icon": "/images/logos/MySqlLogo.png",
          "description": "Für die Speicherung der Statistiken meiner Spieler verließ ich mich auf MySql als meine bevorzugte Datenbanklösung, die sich als zuverlässige und effiziente Wahl erwies."
        }
      ],
      "emergence": "Ein Lehrer an meiner Schule stellte mir das Kardea Price-Projekt vor, das sich auf Jugendliche und Geldmanagement konzentriert. Dies brachte mich auf die Idee eines Spiels, bei dem der Benutzer das Verwalten seiner Ausgabegewohnheiten üben kann.",
      "result": "Eine Website, auf der Spieler das Spiel spielen und etwas über Geld lernen können.",
      "link": "https://budget-booster.vitreus.at/",
      "linkName": "BudgetBooster"
    },
    {
      "name": "Furt",
      "description": "Furt ist ein Mobilspiel über Farben. Der Spieler muss die Farbe im richtigen Bereich abschießen und Hindernissen ausweichen. Das Spiel wurde mit Unity erstellt und läuft auf Android.",
      "img": "/images/furt.png",
      "icons": ["/images/icons/furt1.png", "/images/icons/furt2.png"],
      "backgroundColor1": "#f244d8",
      "backgroundColor2": "#ecba4e",
      "usedTechnologies": [
        {
          "name": "Unity",
          "icon": "/images/logos/UnityLogo.png",
          "description": "Unity ist meine bevorzugte Spiel-Engine für die Programmierung von Spielen, dank ihrer integrierten Unterstützung für Mobilgeräte, die perfekt für die Erstellung meines Mobilspiels geeignet ist."
        },
        {
          "name": "Photoshop",
          "icon": "/images/logos/PSLogo.png",
          "description": "Mit Photoshop konnte ich alle erforderlichen Assets für meine Spiele erstellen."
        }
      ],
      "emergence": "Ich hatte etwas Freizeit und beschloss, ein Mobilspiel zu erstellen. Obwohl ich bereits Vorwissen in Unity hatte, hatte ich zuvor noch nie ein Mobilspiel entwickelt. Da ich ein Spiel basierend auf Farben erstellen wollte, begann ich mit der Programmierung.",
      "result": "Ein Mobilspiel namens FURT für Android.",
      "link": "https://mega.nz/file/BQIQDaCA#2BB5DcKipsTNz0WgulyojwGsuiVGMQVDQ81VsAE02hA",
      "linkName": "Download"
    },
    {
      "name": "ExploreHTL",
      "description": "Explore HTL ist ein Spiel in dem die Spieler verschieden Items in der IT-HTL Ybbs sammeln können. Das Spiel wurde für den Infotag 2023 entwickelt",
      "img": "/images/explorehtl.png",
      "icons": ["/images/icons/utensils.png", "/images/icons/db_uebung.png"],
      "backgroundColor1": "#00aacc",
      "backgroundColor2": "#00d8a2",
      "usedTechnologies": [
        {
          "name": "Unity",
          "icon": "/images/logos/UnityLogo.png",
          "description": "Unity macht AR entwicklung ohne rießigen Aufwand möglich."
        },
        {
          "name": "Firebase",
          "icon": "/images/logos/firebaseLogo.jpg",
          "description": "Die Daten der Spieler wurde in Firebase Firestore gespeichert"
        },
        {
          "name": "Svelte",
          "icon": "/images/logos/SvelteLogo.png",
          "description": "Svelte wurde für das Leaderboard verwendet. Firebase konnte sehr leicht mit Svelte verbunden werden"
        }
      ],
      "emergence": "Für den Infotag 2023 haben Felix Blaimauer und ich gemeinsam an einem Projekt gearbeitet. Mit unserem ARGame haben wir uns einer spannenden Herausforderung gestellt",
      "result": "Explore HTl IOS und Android App + Online Leaderboard",
      "link": "https://github.com/Hannes30",
      "linkName": "Github"
    }
  ]
}
